{
  "heading": "Over 100,000 closets sold to happy customers.",
  "ratingName": "Excellent",
  "amountOfStars": "4.7",
  "amountOfReviews": "3,654",
  "buttonLink": "https://www.trustpilot.com/review/modularclosets.com",
  "buttonText": "See All Reviews",
  "reviews": [
    {
      "displayName": "Valerie Gembecki",
      "experiencedAt": "Nov 29, 2025",
      "stars": 5,
      "title": "Used for multiple jobs",
      "text": "We've used Jim Gillis @ Modular Closets for multiple jobs now and have always had a great experience, as have our customers that we referred. He is super helpful with the layout and always assures that all necessary pieces are included and shipped with the order."
    },
    {
      "displayName": "Steven M",
      "experiencedAt": "Oct 25, 2025",
      "stars": 5,
      "title": "Seamless process",
      "text": "I used Modular Closets for the first time on a Florida renovation with Jerry as my designer. The process from design to deliver was seamless and the installation was simple and results were beautiful."
    },
    {
      "displayName": "Cory Pritchard",
      "experiencedAt": "Sept 23, 2025",
      "stars": 5,
      "title": "Happy using Modular in all my builds",
      "text": "I am a residential contractor and use their products in all of my builds. They provide a great product backed with great service and always perform. Great partner for my company."
    },
    {
      "displayName": "Natalie Zigweid",
      "experiencedAt": "July 1, 2025",
      "stars": 5,
      "title": "Affordable quality closets",
      "text": "Modular closets has allowed me to give my clients an affordable quality product! They are so easy to work with and Eli is always quick to get designs back to me. I was quoting custom cabinetry for closets before this and the pricing was insane. Modular closest are worth it but still affordable!"
    },
    {
      "displayName": "Preston Funkhouser",
      "experiencedAt": "April 30, 2025",
      "stars": 5,
      "title": "Very helpful with the design",
      "text": "Since installing a modular closet system in my client's master closet a few weeks ago, she has texted me three times telling how much she absolutely loves her new closet system. I've worked for this client several times before and this is the most positive reaction I've received from her. Eli at the Pro Division was very helpful with the design."
    },
    {
      "displayName": "Shawn Huck",
      "experiencedAt": "April 28, 2025",
      "stars": 5,
      "title": "Easy and professional home closets",
      "text": "Very happy with Modular closets. Ordered multiple closets from them. Everything turns out perfectly, with their professional design team. They help work within a budget and can design to fit your needs. Give them the measurements and they will show you what they can do!"
    },
    {
      "displayName": "Quantum Realm Construction",
      "experiencedAt": "April 27, 2025",
      "stars": 5,
      "title": "The customer service is great!",
      "text": "The customer service from design to delivery and through installation is absolutely fantastic. Thank you. I am a General Contractor and will be using again."
    },
    {
      "displayName": "Mike Wood",
      "experiencedAt": "April 13, 2025",
      "stars": 5,
      "title": "Customer was very pleased",
      "text": "I have to say that I was pleased that you were able to work with me on pricing so I was able to sell this job to my client. Went together pretty painlessly and customer is very pleased with outcome and I was able to make some money doing the install."
    },
    {
      "displayName": "Anthony Delasota",
      "experiencedAt": "",
      "stars": 5,
      "title": "Worked together for 8 years",
      "text": "I have been dealing with Modular Closets for at least eight years and I've built numerous closets, numerous closets, laundry room, furniture everything that I have bought has been top-notch and the people that work for the company are always very attentive."
    },
    {
      "displayName": "Kirk A Reed",
      "experiencedAt": "",
      "stars": 5,
      "title": "Great job Modular Closets Pro Department",
      "text": "Jim Gillis provided us with extraordinary drawings and notes to present to our client to make their choices. The closet shipment and packaging were great with a tailgate delivery rolling the pallet thru the snow right into the garage."
    },
    {
      "displayName": "Susann Wheeler",
      "experiencedAt": "",
      "stars": 5,
      "title": "Strategic partner",
      "text": "As an interior designer it is very important to collaborate with trusted people in supporting industries. Jim in the Pro Division of Modular closets is a strategic partner who provides excellent customer service and quick turnaround times."
    },
    {
      "displayName": "Manuela",
      "experiencedAt": "",
      "stars": 5,
      "title": "Seamless process",
      "text": "Great experience with the team and products! The communication was excellent from start to finish, making the process seamless. The quality of these closets is great, and a well-thought-out design. Perfect for both multi-family projects and residential spaces."
    },
    {
      "displayName": "Carolina Glass Shak",
      "experiencedAt": "",
      "stars": 5,
      "title": "Cory and the Pro department are awesome!",
      "text": "Cory and Pro Department are awesome. They are very quick on getting your designs back & orders shipped out. The shelving units are top quality. And the new hardware colors look awesome!"
    },
    {
      "displayName": "Kyle Moyer",
      "experiencedAt": "",
      "stars": 5,
      "title": "Upscale reno projects",
      "text": "I am a contractor that values a product for its durability, ease of installation, visual appeal, and functionality. I used this closet system for the first time on my own personal build before recommending it to future clients. This closet system checks all the boxes and will fit perfectly into my upscale renovation projects without blowing the budget."
    }
  ]
}
